package com.agridata.cdzhdj.data.law;

/**
 * @Author : lzx
 * @PROJECT_NAME : HarmlessApp
 * @Date : on 2023-04-14 08:50.
 * @Description :描述   	种畜禽领域
 */
public class LivestockPoultryFieldsBean {

    //成都市畜禽养殖场执法检查记录表
    public  int zxq1=-1;//使用未取得新饲料、新饲料添加剂证书的新饲料、新饲料添加剂或者未取得饲料、饲料添加剂进口登记证的进口饲料、进口饲料添加剂
    public  int zxq2=-1;//使用无产品标签、无生产许可证、无产品质量标准、无产品质量检验合格证的饲料、饲料添加剂
    public  int zxq3=-1;//在饲料或者动物饮用水中添加饲料添加剂，不遵守国务院农业行政主管部门制定的饲料添加剂安全使用规范	查看现场、生产记录	是□   否□
    public  int zxq4=-1;//使用自行配制的饲料，不遵守国务院农业行政主管部门制定的自行配制饲料使用规范
    public  int zxq5=-1;//使用限制使用的物质养殖动物，不遵守国务院农业行政主管部门的限制性规定
    public  int zxq6=-1;//在反刍动物饲料中添加乳和乳制品以外的动物源性成分
    public  int zxq7=-1;//在饲料或者动物饮用水中添加国务院农业行政主管部门公布禁用的物质以及对人体具有直接或者潜在危害的其他物质，或者直接使用上述物质养殖动物，直接使用原料药
    public  int zxq8=-1;//未经兽医开具处方购买、使用兽用处方药
    public  int zxq9=-1;//未建立用药记录或者记录不完整真实的，未建立养殖档案或未按照规定保存养殖档案
    public  int zxq10=-1;//未按照国家有关兽药安全使用规定使用兽药的，或者使用禁止使用的药品和其他化合物的，或者将人用药品用于动物	查看现场、生产记录	是□   否□
    public  int zxq11=-1;//养殖者发现其使用的饲料、饲料添加剂对养殖动物、人体健康有害或者存在其他安全隐患的，未立即停止使用、未向饲料管理部门报告
    public  int zxq12=-1;//兽药使用单位和开具处方的兽医人员发现可能与兽药使用有关的严重不良反应，不向所在地人民政府兽医行政管理部门报告


    /*************  成都市种畜禽和水产种苗执法检查记录表  two *****************/
    public  int zxqTwo1 =-1;//是否持有有效的种畜禽和水产种苗《生产经营许可证》
    public  int zxqTwo2 =-1;//种畜禽和水产种苗《生产经营许可证》发放机构是否符合规定
    public  int zxqTwo3 =-1;//是否持有有效的种畜禽《动物防疫条件合格证》（水产苗种场不作要求）
    public  int zxqTwo4 =-1;//是否按照规定的品种、品系、代别和利用年限从事生产经营
    public  int zxqTwo5 =-1;//是否建立生产和育种档案，
    public  int zxqTwo6 =-1;//是否建立和实施防疫制度
    public  int zxqTwo7 =-1;//销售的种畜禽和水产种苗是否达到国家标准、行业标准或者地方标准，并附有种畜禽和水产种苗场出具的种畜禽和水产种苗《合格证》。
    public  int zxqTwo8 =-1;//进行畜禽专业配种（包括人工授精）、孵化的，是否使用从种畜禽场引进并附有种畜禽场出具的《种畜禽合格证》、种畜系谱
    public  int zxqTwo9 =-1;//是否建立安全生产制度,设置安全防护设施、警示标识,配备救生、消防设备,组织安全培训
}
